#print("Hello world")

 #while - пока                                                                    #числоовой тип: ``
 #for -                                                                    # кандай числовой тип ? int, float, complex
 #in -                                                                            #> - больше"````                                                                                                                                                                                                                                                                                                                                                                                                                                                    
 #if - если
#elif - иначе,андыктан                                                          #переменный - ящик 
 #else - еще,кобүрөөк                                                            встроенная функция :
 #print - экранга  информациячыгарып берет                                      print , input 
# input - вывод,ввод пользывательден сурооталап кылат 
 #complex - комплексные число j
 #max - максимальный
 #min - минималистичный
 #sum - сумма   
#type - кайсы типке кирет айтып берет

 # jango  - не законченный сайт  фреймворк 

#13,34,453,34,4556,46,56,32,- int жонокой саH

#45.14, 455.6 , 253.56 , - float бөлчөк сандар 

#complex -комплексные число j

# bool type (True,False) - True - правда, False - лож 
# slice -срез, кесүү
#name = "john"
#print (name)


                #методы в питон :
# upper() - тексти чоңойтуп берет,верний регистрди чыгарып берет 
# lower()- тексти чирейтет,нижный регистрди кайтарып берет
#title() - главный букваларды чон кылат  
#strip() - удаление пробелов в начале или в конце, серединаны албайтй букваларды чоң кылат 
# replace - заменяет текст другой строки
#split ()-бул страканы под стракага бөлөт,тексти бөлүп коет 
#count(rhriodf)-Возвращает количество раз, когда значение «яблоко» появляется в строке:
#find-индекст таап берет ,санайт
#index - find экөө окшош индекти таап берет
#isalpha- страка буквадан туурабы же жокпу ошону аныктап берет
#isdigit - страка цифрадан туурабы ошону аныктайт
# lstrip - пробелди сол жактан удалитетет
# rstrip() - оң жактагы пробелди удалитетет
#strip - башынан жана аягынан пробулди удалитетип коет
#"",''- КАВЫЧКА

             # функция:
#len() - элементтерди санайт рассчетко алганда 1 ден эсептейт,тексти эсептеп берет


             #ОПЕРАТОР
#in- проверка кылып берет


# отрицательная индекс тескеринен санайт
#переменная это ящик

         #призвольный 
#[]
               #Конкатенация строки
# a = "Hello"              эки же андан коп страканы кошот
# b = "World"                 int менен страканы кошсо болбойт
# c = a + b
# print(c)
