#print("Hello world")

    
 #while - пока                                                                    #числоовой тип: ``
 #for - перебирайтеткенге жардам берет , вертикально                                                                   # кандай числовой тип ? int, float, complex
 #in - ичиндечи, проверка кылып берет                                                                          #> - больше"````                                                                                                                                                                                                                                                                                                                                                                                                                                                    
 #if - если
#elif - иначе,андыктан                                                          #переменный - ящик 
 #else - еще,кобүрөөк                                                            встроенная функция :
 #print - экранга  информациячыгарып берет                                      print , input 
# input - вывод,ввод пользывательден сурооталап кылат 
 #complex - комплексные число j
 #max - максимальный
 #min - минималистичный
 #sum - сумма   
#type - кайсы класска кирет айтып берет
# sort() - сортирофка кылып берет
# step - шаг , шагайтетет
# [] - лис
# renge - диапазон , сандар менен иштесе



 # jango  - не законченный сайт  фреймворк 

#13,34,453,34,4556,46,56,32,- int жонокой сан

#45.14, 455.6 , 253.56 , - float бөлчөк сандар 

#complex -комплексные число j

# bool type (True,False) - True - правда, False - лож 
# slice -срез, кесүү
#name = "john"
#print (name)


                #методы в питон :
# upper() - тексти чоңойтуп берет,верний регистрди чыгарып берет 
# lower()- тексти чирейтет,нижный регистрди кайтарып берет
#title() - главный букваларды чон кылат  
#strip() - удаление пробелов в начале или в конце, серединаны албайтй букваларды чоң кылат 
# replace - заменяет текст другой строки
#split ()-бул страканы под стракага бөлөт,тексти бөлүп коет 
#count(rhriodf)-Возвращает количество раз, когда значение «яблоко» появляется в строке:
#find-индекст таап берет ,санайт
#index - find экөө окшош индекти таап берет
#isalpha- страка буквадан туурабы же жокпу ошону аныктап берет
#isdigit - страка цифрадан туурабы ошону аныктайт
# lstrip - пробелди сол жактан удалитетет
# rstrip() - оң жактагы пробелди удалитетет
#strip - башынан жана аягынан пробулди удалитетип коет
# append - элемент аягына кошот
# remove - элеммент удалитетет
# continue - кесет
#"",''- КАВЫЧКА

             # функция:
#len() - элементтерди санайт рассчетко алганда 1 ден эсептейт

             #ОПЕРАТОР
#in- проверка кылып берет

         #Шартту оператор
# == - барабар
# != - барабар эмес
# >  -- чон
# < - - кичине
# >= -чон же барабар
# <= - кичне же барабар
#  += - присвеватететь , кошуп

    # оператор 
  # break - токтотот


      #Питондо эки примитивниый цикл

# 1 while  - 2 for
# while - Истина , пока
     #continue - улантуу

    #             цикл
    #  for - перебирайтеткенге жардам берет , вертикально
        

# отрицательная индекс тескеринен санайт
#переменная это ящик

         #призвольный 
#[]
               #Конкатенация строки
# a = "Hello"              эки же андан коп страканы кошот
# b = "World"                 int менен страканы кошсо болбойт
# c = a + b
# print(c)


# dict:
#keys - ачкычты чыгарып берете , dick 
# get  - Значенияны чыгырып берет 
# values - Значенияны чыгарып берет
# items -кортеж вариянтында кайтарып берет 
# in - проверка кылып берет
#Значение озгорот,ключ озгорбойт
# update - Элемент кошот
# pop -с


# set: {} - ушул скобка колдонулат
    #set - Ирээттелген эмес тип данныхка кирет
#Индекс жок,колдонулбайт
# add -  элемент кошот , сетке
# update - Элемент кошот
# remove - элементти удалитетет
# pop - случайный элементти удалитетет
# clear - наборду очищайтетет
# определённый элементти чыгарыш учун цикл for колдонулать
# # union - объединайтетет элементти
# Indentation update - 'rb 'эки элемменттеги окшош создорду чыгарып берет
thisset = {"apple", "banana", "cherry"}
tropical = {"pineapple", "mango", "papaya"}

thisset.update(tropical)

print(thisset)           # эки элементти бир кылып кошот